In [49]:
from google.colab import auth
auth.authenticate_user()

import gspread
from oauth2client.client import GoogleCredentials

gc = gspread.authorize(GoogleCredentials.get_application_default())

In [50]:
spreadsheet = gc.open_by_url('https://docs.google.com/spreadsheets/d/1UsBBJ43s3TTrIHeRYo7CQh5uJ1IS6bhtUbDMir-jhZM/edit#gid=0')

In [51]:

page = spreadsheet.sheet1

In [52]:
page.row_values(1)

['Check', 'Waiter', 'Total_Bill', 'Of_Persons']

In [53]:
import pandas as pd

In [54]:
waitress = pd.DataFrame(page.get_all_records())

In [55]:
waitress.head()

   Check  Waiter  Total_Bill  Of_Persons
0    134     Amy      151.57           5
1    135  Lauren      128.11           6
2    136   Kevin      107.49           6
3    137      TJ       48.93           4
4    138    Raul      103.31           6

In [59]:
waiterAmy = waitress.query('Waiter == "Amy"').

waiterAmy.head()

     Check Waiter  Total_Bill  Of_Persons
0      134    Amy      151.57           5
11     145    Amy       27.34           6
64     198    Amy       63.31           2
87     221    Amy       90.03           4
129    263    Amy       23.00           5

In [80]:
waitressGroupingTotalB = waitress.groupby('Waiter').agg({'Total_Bill': ['sum']})
waitressGroupingTotalB.sort_index (axis = 1 , ascending=True )
waitressGroupingTotalB.head()

       Total_Bill
              sum
Waiter
Alex      1178.80
Amanda     238.73
Amit       431.12
Amy        628.14
Anne       501.12

In [81]:
waitressGroupingTotalP = waitress.groupby('Waiter').agg({'Of_Persons': ['sum']})
waitressGroupingTotalP.sort_index (axis = 1 , ascending=True )
waitressGroupingTotalP.head()

       Of_Persons
              sum
Waiter
Alex           54
Amanda         16
Amit           20
Amy            34
Anne           26